Enterprise_Serivces/Cert/Bronze2/CSLConfigurationService-SG/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/csl/configuration/v1.0">ee378a17-4acc-475e-b100-509195a48980</CorrelationID><MachineName xmlns="http://www.gamestop.com/csl/configuration/v1.0">test</MachineName><wsa:Action>http://www.gamestop.com/csl/configuration/v1.0/IConfigurationService/GetStoreConfigurationByName</wsa:Action><wsa:MessageID>uuid:596108e8-52fb-4772-84c1-503e8276ff5d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>https://gatewayqa1.testgs.pvt/v1/Configuration</wsa:To></soap:Header><soap:Body><GetStoreConfigurationByNameRequest xmlns="http://www.gamestop.com/csl/configuration/v1.0"><BaseConfigName>Default</BaseConfigName><StoreNumber>1363</StoreNumber><TemplateName>POS</TemplateName></GetStoreConfigurationByNameRequest></soap:Body></soap:Envelope>